
# ディレクトリを水色にする｡
# lsコマンドのカラー表示
# 白　一般的なファイル（デフォルト）
# 青　ディレクトリ（アンダーライン付き）
# 赤　バイナリー
# 黄　名前付きパイプ、ソケット、ブロックデバイス、キャラクタデバイス
# 緑　書庫ファイル(*.tgz,*.gz,*.tar,*.lzh,*.LZH,*.lha,*.zip,*.z,*.Z,*.rpm)
# 紫　画像ファイル(*.gif,*.jpg,*.tif,*.eqs,*.ps,*.bmp,*.xwd,*.JPG,*.jpeg,*.obj)

export LS_COLORS='no=00:fi=00:di=01;34:ln=01;36:pi=40;33:so=01;35:bd=40;33;01:cd=40;33;01:or=01;05;37;41:mi=01;05;37;41:ex=01;32:*.cmd=01;32:*.exe=01;32:*.com=01;32:*.btm=01;32:*.bat=01;32:*.sh=01;32:*.csh=01;32:*.tar=01;31:*.tgz=01;31:*.arj=01;31:*.taz=01;31:*.lzh=01;31:*.zip=01;31:*.z=01;31:*.Z=01;31:*.gz=01;31:*.bz2=01;31:*.bz=01;31:*.tz=01;31:*.rpm=01;31:*.cpio=01;31:*.jpg=01;35:*.gif=01;35:*.bmp=01;35:*.xbm=01;35:*.xpm=01;35:*.png=01;35:*.tif=01;35:'

#export LS_COLORS='no=00:fi=00:di=01;34:ln=04;36:pi=40;33:so=40;33:bd=40;33:cd=40;33:ex=01;31:or=04;36:*.tgz=01;32:*.gz=01;32:*.tar=01;32:*.lzh=01;32:*.LZH=01;32:*.lha=01;32:*.zip=01;32:*.z=01;32:*.Z=01;32:*.rpm=01;32:*.gif=01;35:*.jpg=01;35:*.tif=01;35:*.eqs=01;35:*.ps=01;35:*.bmp=01;35:*.xwd=01;35:*.JPG=01;35:*.jpeg=01;35:*.obj=01;35'

# 補完候補の色づけ
zstyle ':completion:*:default' list-colors ${(s.:.)LS_COLORS}
